# PANDAS TUTORIAL  @codewithharry

In [4]:
import numpy as np 
import pandas as pd

In [5]:
dict1 = {
    "Name":['Sudarshan','Sourabh','Tanish','Harshada'],
    "Marks":[56,25,77,37],
    "City":['Nagpur','Mumbai','Kolhapur','Karnataka']
    
}

In [6]:
df1 = pd.DataFrame(dict1)

In [7]:
df1

        Name  Marks       City
0  Sudarshan     56     Nagpur
1    Sourabh     25     Mumbai
2     Tanish     77   Kolhapur
3   Harshada     37  Karnataka

*It Identify each row by index and each column by column name in the above dataframe*

In [8]:
df1.to_csv('Friends.csv')

In [10]:
df1.to_csv('Friends_index_false.csv',index=False)